# Напишите программу, которая считывает длины двух катетов в
# прямоугольном треугольнике и выводит его площадь.
# Каждое число записано в отдельной строке.

a = float(input())
b = float(input())
s = 1/2 * a * b
print(s)
