# Напишите программу, которая приветствует пользователя, выводя слово Hello,
# введенное имя и знаки препинания.

print('What is your name?')
name = input()
print('Hello, ' + name + '!')
